{"chunks": ["One Convergence Internal Document​\n     ​\nConfidential\n​\n \n \nEmployee Referral Policy \n \n \n \nOne Convergence believes employee referrals as an excellent way to obtain qualified candidates \nfor open positions within the company. This policy encourages and awards employees who refer \ncandidates that are hired. \n \n \n●​\nAll regular employees are eligible for employee referral program except HR, Managers, \nand Directors and above. \n●​\nEmployees are eligible for referral bonus if the referred employee is hired by the \ncompany as a full time employee.  \n●​\nReferral Bonus is not applicable if referred for temporary, internship or contract positions. \n●​\nThe referring employee must represent the candidate’s first contact with One \nConvergence.  \n●​\nTo be eligible for a referral bonus, the employee must submit the referred candidates \nresume to the HR department first. \n●​\nIn case of a duplication wherein the same candidate is referred / received, the concept of \nfirst in would be considered who", "se information will be shared by HR. \n●​\nAny disputes or interpretations of this program will be handled through Human \nResources, and all decisions and/or judgments of Human Resources and the Company \nare final. \n●​\nThe referral bonus will be paid after the referred candidate completes 6months in One \nConvergence. \n●​\nReferral policy is not applicable towards referring a candidate whose experience is less \nthan a year. \n●​\nThe referral bonus amount is given below. \n​\n \nCandidate with 01+ years experience to 03 years : ​\nRs. 15,000 \nCandidate with 03+ years experience to 08 years :​\nRs. 20,000 \nCandidate with 08+ years experience to 12 years :​\nRs. 30,000 \nCandidate with 12+ years experience and above  :​\nRs. 40,000 \n \nThe policy is framed as per the current requirements and needs of the company. Changes in the \npolicy can be made anytime depending upon the need basis whose information would be shared \nto the employees simultaneously. \n \nThis document is One Convergence Internal Propri", "etary document and cannot be used \nelsewhere without the prior permission from the Company Management. \nOne Convergence Devices Pvt. Ltd. ​\nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/ \n​\n \n", " \n \nPrepared : \n \nMar 31, 2025\nLast Modified : \n \nMay 22, 2025\nThis policy outlines the guidelines for One Convergence India Office employees availing Work From \nHome (WFH) privileges to ensure flexibility while maintaining productivity and accountability. This policy is \nin effect from April 01, 2025 \nEligibility: \n●​\nAll full-time employees who have completed their one year employment are eligible for WFH on \nPro rata basis. \n●​\nWFH is permitted only for roles where remote work can be effectively managed. \n●​\nWFH may be revoked or denied in cases of urgent deliverables or when the company requires \nyour presence at the workplace.  \nWFH Allowance: \n●​\nEach employee is entitled to 24 WFH days per calendar year. \n●​\nWFH’s are on accrued basis. \n●​\nMaximum of 12 WFH can be taken at a stretch \nWFH Request Process: \n●​\nEmployees must submit their WFH request via email to their respective manager, copying \noc-vacation@oneconvergence.com at least 24 hours in advance (except in extreme \nemerg", "encies). \n●​\nThe request must be approved by the reporting manager to ensure alignment with team \ndeliverables and business requirements. \nWFH Guidelines: \n●​\nEmployees must plan necessary arrangements at home to ensure a productive work environment \nand should be equipped to address any laptop or internet issues independently without relying on \noffice support. \n \n \nOne Convergence Devices Pvt. Ltd. \nRegd. Office: 2nd  Floor East Wing,  \nKRB Towers, Plot No’s - 1,2,3 4 & \n4/A,Madhapur,Hyderabad 500081            \nwww.oneconvergence.com  ", " \n \n●​\nEmployees must be available online during core working hours (10:00 AM - 7:00 PM) unless \nspecified otherwise. \n●​\nRegular check-ins with the reporting manager or team or customer are mandatory. \n●​\nEmployees are expected to maintain the same level of professionalism and responsiveness as \nthey would in the office. \n●​\nAny technical or connectivity issues that hinder work progress must be reported immediately. \n●​\nLong (2 weeks) WFH must be pre-approved by the respective manager atleast 1 month before \navailing, copying oc-vacation@oneconvergence.com. \n●​\nWork from Home (WFH) can be combined with leaves or holidays only if they are scheduled \nconsecutively and not interspersed. For example, alternating between a day of leave, a day of \nWFH, and then another leave or WFH is not permitted. Such combinations disrupt effective work \nplanning for managers and customers. \n●​\nWFH requests will be limited to 24 days within a calendar year. If an employee requires additional \nWFH days be", "yond this limit, their manager must obtain special approval from the Centre Head \nwith HR in copy. \n●​\nWFH is not available for freshers during their first year of employment and for others during their \nprobationary period \n●​\nWFH cannot be availed during notice period \nAccountability: \n●​\nMaintain regular working hours and be available during core collaboration times. \n●​\nStay responsive via official communication channels (email, chat, calls) as required. \n●​\nNon-compliance with WFH guidelines may result in loss of WFH privileges or disciplinary action. \n●​\nMeet deadlines and deliver assigned tasks with the expected quality. \n●​\nRegularly update the reporting manager on progress and any potential delays. \n●​\nAdhere to company security protocols when accessing systems, tools, and data. \n●​\nAvoid using public or unsecured networks unless approved VPNs are used. \n●​\nActively participate in scheduled meetings, discussions, and team updates. \n●​\nEnsure effective communication to avoid mi", "sunderstandings or delays. \nThis document is intended for internal use only and will be updated periodically as needed. While we will \nmake an effort to notify of any changes, we strongly recommend reviewing this document regularly to stay \ninformed. For the most accurate and up-to-date information, please consult with HR or the Centre Head. \n \n \nOne Convergence Devices Pvt. Ltd. \nRegd. Office: 2nd  Floor East Wing,  \nKRB Towers, Plot No’s - 1,2,3 4 & \n4/A,Madhapur,Hyderabad 500081            \nwww.oneconvergence.com  \n", "One Convergence Internal Document  ​\n​\nConfidential \n \n \n \nIT Policy   \n \nThe company provides the best available Infrastructure to employees in order to complete their \ngiven  work in time. All the resources provided to employees are for Official purpose only.   \n \n●​ Organizational User IDs and e-mail accounts may only be used for organizational needs.   \n●​ It is prohibited to send or forward any email or other communication or attachments or \nemail  status, which may be considered as offensive by an individual or a group of \npeople. This includes,  but is not limited to political, religious, caste, regional, sexual or \nany other material.   \n●​ Use of Internet/intranet/e-mail/instant messaging may be subject to monitoring for \nreasons of  security and network management and users may have their usage of these \nresources subjected  to limitations by the Organization.   \n●​ Employees may not use official IT infrastructure (including but not limited to email \naccount,  office computin", "g equipment, computers, laptops, tablet, printer, network, VPN \netc) to visit  Internet sites or access or download or forward in any form any material that \ncontains obscene,  hateful or other objectionable material, shall not attempt to bypass \nOrganizational surf control  \ntechnology and shall not make or post any remarks, \nproposals or materials on the Internet which  may be deemed obscene, hateful or \nobjectionable.   \n●​ Employees shall not solicit or send e-mails that are unrelated to the business activity of \nthe  company or which are for personal gain, shall not send or receive any material which \nis obscene  or defamatory or which is intended to annoy, harass or intimidate another \nperson and shall not  present personal opinions as those of the company and the use of \norganizational e-mail facilities.   \n●​ Employee may not upload, download or otherwise transmit commercial software or any  \ncopyrighted materials belonging to the company or any third parties, may not reveal or", " \npublicize  confidential information, and will not send confidential e-mails without prior \napprovals.   \n●​ Employees may not use office IT Infrastructure or devices to download software from the  \nInternet or execute or accept any software programs or other code on the Internet unless \nit is in  accordance with the Organization’s policies and procedures.   \n●​ Employees will not use the resources or time of the company in any manner which \nviolates  intellectual property rights (such as third party copyrighted material) and/or laws \nof the land.   \n●​ Employees are prohibited from downloading content such as streaming video and MP3 \nmusic  \nfiles, sharing digital photographs and similar material which may violate \nIntellectual Property  laws. In addition, this results in wastage of precious bandwidth, for a \nprohibited activity.  \n●​ One Convergence reserves the right to audit networks and systems on a periodic basis \nto ensure  compliance with this policy.   \n \n \n \nOne Convergence ", "Devices Pvt. Ltd.   \nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/   ", "One Convergence Internal Document  ​\n​\nConfidential \n \n \n \n \n●​ Keep passwords secure and do not share accounts. System-level passwords should be \nchanged  on a periodic basis.   \n●​ All PC’s, laptops, and workstations should be secured with a password-protected \nscreensaver  with the automatic activation feature set at ten minutes or less, or by \nlogging off when the host  will be unattended.   \n●​ Because information contained on portable computing or storage devices is especially  \nvulnerable, special care should be exercised. It is the employee's responsibility to protect \nand  ensure security of company equipment (such as laptop or other computing or \nstorage or data  device) and any company confidential information contained therein.   \n●​ Postings by employees from official e-mail address to newsgroups, forums, social \nnetworks etc  should contain a disclaimer string that the opinion expressed are strictly \ntheir own and not  necessarily those of One Convergence, unless posting ", "is made in the \ncourse of business duties  with appropriate approval.   \n●​ Any computing device, whether owned by the employee or One Convergence used on \nthe office  Internet/intranet/extranet/VPN must always run an approved virus-scanning \nsoftware.   \n●​ Employees must use extreme caution when opening e-mail attachments received from \nunknown  senders; these may contain viruses, e-mail bombs, or Trojan horse code.   \n●​ Any form of harassment via e-mail, telephone, paging, chatting or any other means, \neither  through language, frequency, or size of messages is not allowed   \n●​ Unauthorized use or forging of e-mail header information is not acceptable   \n●​ Employees are required to escalate any suspicious activity or incident to the IT Head / \nIDC Head / HR at One Convergence immediately.   \n \nThe following guidelines would help in better and safer utilization of IT resources:   \n \n●​ Shared files or data must be password protected to prevent unauthorized access or \nmisuse.   \n●​", " Regularly update Operating System, web browser, and other major software, using the  \nmanufacturers' update features, preferably using the auto update functionality. (Consult \nSystem  Administrator for this activity). Use antivirus software, and update it on a regular \nbasis to  recognize the latest threats.   \n●​ Save attachments to the drive / disk before opening them.  \n●​ Don't write down your password. Or don’t give out your password to anyone, whether you \nknow  them or not & don’t select the \"Remember My Password\" option.   \n●​ Don't leave your laptop unattended, even for a few minutes.   \n●​ Don't install or use pirated copies of software.   \n●​ Don't install P2P file sharing programs which can increase the vulnerability of your \nsystem and  also overload the office network bandwidth.   \n●​ Don't set your e-mail program to \"auto-open\" attachments.   \n \n \n \nOne Convergence Devices Pvt. Ltd.   \nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad", " 500081,INDIA.  \nhttp://oneconvergence.com/   ", "One Convergence Internal Document  ​\n​\nConfidential \n \n \n \n \n \n●​ Don't run any internet servers. Running web, mail, ftp (etc) servers from your desktop \nleaves  your data vulnerable.   \n●​ Employees using their personal laptops need to ensure that they back up the company \ndata to  the company provided machine and delete any and all materials which are of \ncompany interest.   \n●​ Employees should keep all their working notes in the drive only and have to ensure \nperiodic back up of all work related material stored in the disk at regular intervals \n(employees are strongly recommended not to store any data in the disk) \n●​ Employees have to ensure that all the system related units are switched off or  \nsuspended/hibernated while leaving for the day, exceptions being made where the \nsystem is in  use (for testing etc) or if the employee is working from home, and needs \naccess to the system.   \n \n \nThe policy is framed as per the current requirements and needs of the company. Changes in t", "he \npolicy  can be made anytime depending upon the need basis whose information would be \nshared to the  employees simultaneously.   \n \nThis document is One Convergence Internal Proprietary document and cannot be used \nelsewhere without  the prior permission from the Company Management. \n \nOne Convergence Devices Pvt. Ltd.   \nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/   \n", "One Convergence Internal Document                                  ​\nConfidential \n \n \nLEAVE POLICY \n \nOne Convergence recognizes the needs and importance of its employees' off time from the work, \nwhich will help its employees to have the proper balance of work time and personal time. This \npolicy is applicable to all full time employees of One Convergence. The policy provides for the \nfollowing:  \n \n●​\nSick Leave (SL)  \n●​\nCasual Leave (CL) \n●​\nMarriage Leave \n●​\nPaternity Leave  \n●​\nBereavement Leave (BL) \n \nGeneral Leave Rules: \n \n●​\nAll leaves are calculated for a calendar year (January to December). \n●​\nPrefixed & Suffixed holidays/weekly off are not treated as leave.  \n●​\nAny intervening holidays/weekly off days falling within the leave period will not be counted as \nleave. \n●​\nIf an employee joins before 15th of the month, that month is considered for calculating the \nentitlement of leave for the year. Similarly, at the time of leaving service, periods of less than \n15 days ser", "vice in a month will not be counted for calculation of entitlement.   Leave \naccumulation stops from the time of resignation and no leave (WFH) can be taken during the \nnotice period. \n●​\nAll casual leaves need prior approvals. \n●​\nIf an employee avails or extends leave without the prior permission, the approval of the leave \nshall be at the discretion of the management.   \n●​\nDisapproved or rejected leave will be considered as Loss of pay.  \n●​\nThere may be compensatory working days in lieu of unforeseen cancellation of work on a \nworking day. \n●​\nLeaves to be availed at a stretch exceeding a period of two weeks needs to be informed and \napproved by manager at least one month ahead.  \n \n \nProcedure for availing leave \n \nEmployee while availing planned leave, must communicate with the immediate reporting Lead & \nManager \nby \nsending \nan \nemail \nto \nthe \nrespective \nLead \n& \nManager \ncopying \noc-vacation@oneconvergence.com. In case of working with the client directly, the employee must ", "\ninform the respective point of contact at Client before seeking leave.  Upon receiving mail \napprovals from respective Lead & Manager (also Clien) the employee can plan for leave / \nvacation. \n \nIn case of availing emergency sick leave, the employee must inform immediate reporting Lead / \nManager & Client (if working directly with them) over the phone about the leave and with the next \ntentative working date. Upon resuming for work, the employee must send an email to reporting \nLead & Manager (And Client - if reporting / working directly with them) marking copy to \noc-vacation@oneconvergence.com about the exact tenure of leave. \n \n \n \nOne Convergence Devices Pvt. Ltd. ​\nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/ \nPage 1 of 3 ", "One Convergence Internal Document                                  ​\nConfidential \n \n \nCasual Leave (CL) \n \nPurpose \n \nNormally intended for rest, recreation, and break from regular official work in order to attend and \ntake care of personal matters. \n \nGuidelines  \n●​\nAll Employees are entitled for 15 days of casual leave, in any full calendar year. If an \nemployee joins during the year (January to December), CL will be calculated on a \npro-rata basis.  \n●​\nAn employee becomes eligible for CL towards every completed month of their service. \n●​\nCL shall not be combined with any other leave. \n●​\nEmployees will be allowed to carry over up to a maximum of 12 from a given year and \naccumulate up to a maximum of 24 days of casual leave. Casual leave in excess of 24 \nwill be lapsed. \n●​\nEmployees should apply at least 2 weeks in advance for availing CL and approval of \nsuch CL leave shall be purely on the discretion of the hiring manager. \n \n \nSick Leave (SL) \n \nPurpose ​\nSick leave is allot", "ted to employees to recover from personal illness or injury.  \n \nGuidelines \n●​\nAll employees are entitled for twelve days of sick leave in a calendar year. If an employee \njoins during the year (January to December), SL will be calculated on a pro-rata basis.  \n●​\nUnutilized sick leave will lapse automatically at the end of the calendar year. \n●​\nAs far as possible, an employee shall give earliest notification, unlike exigencies. \n●​\nDuring emergencies employees should arrange to notify the respective superior/HR officer by \nphone as soon as possible. \n \nMarriage Leaves \n \nAll regular employees who completed one year service with the company are eligible to take \nmarriage leave on the eve of their marriage. Marriage leave is paid at a rate of 100% of normal \npay for up to 5 working days. This is applicable only for the first registered marriage. \n \nPaternity Leave: \n \nMale employees are eligible to take paternity leave following the birth of their first two children. \nPaternity leave ", "is paid at a rate of 100% of normal pay for up to 7 working days. Paternity leave \nmust be taken no later than 1 month of baby birth.  \n \n \n \n \n \n \n \n \nOne Convergence Devices Pvt. Ltd. ​\nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/ \nPage 2 of 3 ", "One Convergence Internal Document                                  ​\nConfidential \n \n \nBereavement Leave (BL)​\n \n​\n​\n \nThis policy outlines the guidelines for employees requesting bereavement leave due to a death of \nan immediate family member. \n \nDefinition of Immediate Family Member: \n \nFor this policy, the definition of an immediate family member includes only the following:  spouse, \nchild, father, father-in-law, mother, mother-in-law, brother, sister, stepfather, stepmother, \nstepbrother, stepsister, stepson, stepdaughter, grandparent or grandchild. \n●​\nDomestic Bereavement Leave:​ Employees are allocated up to three (3) consecutive \ndays off from regularly scheduled work hours with regular pay in the event of the death of \nan immediate family member. \n●​\nNon Domestic Bereavement Leave:  When an employee needs to travel whose travel \ntime is beyond 24 hours to attend the funeral of an immediate family member, the \nemployee is allocated up to five (5) consecutive days off from regu", "larly scheduled work \nhours with regular pay.  \n \n \n \nThe policy is framed as per the current requirements and needs of the company. Changes in the \npolicy can be made anytime depending upon the need basis whose information would be shared \nto the employees simultaneously. \n \nThis document is One Convergence Internal Proprietary document and cannot be used \nelsewhere without the prior permission from the Company Management. \n \n \nOne Convergence Devices Pvt. Ltd. ​\nKBR Towers Second Floor East Wing,  \n​\nPlot Numbers 1,2,3,4 & 4/A, Madhapur Hyderabad 500081,INDIA.  \nhttp://oneconvergence.com/ \nPage 3 of 3 \n"], "sources": ["employee_referral_policy.pdf", "wfh_policy.pdf", "wfh_policy.pdf", "it_policy.pdf", "it_policy.pdf", "it_policy.pdf", "leave_policy.pdf", "leave_policy.pdf", "leave_policy.pdf"]}